app/controllers/api/products_controller.rb

SELECT "products".* FROM "products" WHERE (name ILIKE '%pedigree%')
---
    def search
        query = params[:query]
        if query.present?
            @products = Product.where('name ILIKE ?', "%#{query}%")