app/models/user.rb

    def reset_session_token!
        new_token = generate_unique_session_token
        self.update!(session_token: new_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-09-18 18:07:16.572766"], ["id", 25]]

    def generate_unique_session_token
        loop do
            token = SecureRandom.base64
            next if User.exists?(session_token: token)
---
SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]